---
kind: type
id: T:Autodesk.Revit.DB.Options
source: html/aa41fc13-9f81-836c-4271-82568ba5d7e8.htm
---
# Autodesk.Revit.DB.Options

User preferences for parsing of geometry.

## Syntax (C#)
```csharp
public class Options : APIObject
```

## Remarks
This class determines the output of the Element.Geometry property.